/*************************************************************************
	> File Name: 7_7.c
	> Author: 
	> Mail: 
	> Created Time: 2020年01月15日 星期三 11时40分04秒
 ************************************************************************/

#include<stdio.h>
#define X 10.00//基本工资
int main()
{
    float a,b=0,c;
    printf("请您输入一周工作的小时数：");
    scanf("%f",&a);
    if(a<=40)
    {
        b=X*a;//总金额
        if(b<=300)
        {
            c=0;
            printf("工资总额为%d ,税金为%d ,净收入为%d",b,c,b-c);
        }
        else
        {
            c=300*0.15+(b-300)*0.2;
            printf("工资总额为%d ,税金为%d ,净收入为%d",b,c,b-c);
        }
    }
    else
    {
        b=400+X*(a-40)*1.5;
        if(b<=450)
        {
            c=300*0.15+(b-300)*0.2;
            printf("工资总额为%d ,税金为%d ,净收入为%d",b,c,b-c);
        }
        else
        {
            c=300*0.15+150*0.2+(b-450)*0.25;
            printf("工资总额为%d ,税金为%d ,净收入为%d",b,c,b-c);
        }
    }
    return 0;}
